//列车调整图自2021年4月10日零时起实行。
var lines = [
  {
    "name": "汉口本站",
    "desc": "...",
    "stations": [
      { "name": "汉口", "desc": "本次调图后，汉口本站办客列车228对，比上次调图减少7对，其中：始发、终到153对（始发151列、终到155列），比上次调图减少10对；过路办客75对（包含市郊列车2对），比上次调图增加3对。" },
    ],
  },
  {
    "name": "汉宜客专",
    "desc": "汉宜线总开行列车125.5对(不包含热备单机1对)，比上次调图增加2.5对。",
    "stations": [
      {
        "name": "汉川",
        "desc": "共办理125.5对列车（不包含热备单机1对），其中：办理客运业务35对（下行44列、上行26列），待避0.5对，动检4对，通过86对。",
      },
      {
        "name": "天门南",
        "desc": "共办理108.5对列车（不包含热备单机1对）：其中办理客运业务29.5对（下行31列、上行28列），动检2对，通过77对。",
      },
      {
        "name": "仙桃西",
        "desc": "共办理列车108.5对（不包含热备单机1对），其中：办理客运业务32.5对（下行31列，上行34列），通过74对,动检2对。",
      },
      {
        "name": "潜江",
        "desc": "共办理列车108.5对（不包含热备单机1对），其中：办理客运业务52.5对（下行50列，上行55列），通过54对，动检2对。",
      },
      {
        "name": "荆州",
        "desc": "共办理列车108.5对（不包含热备单机1对），其中始发、终到4对，办理客运业务82.5对（下行70列，上行95列），通过20对，动检2对。",
      },
      {
        "name": "枝江北",
        "desc": "共办理列车104.5对，其中办理客运业务24对（下行21列，上行27列），通过78对，待避0.5对(Z50次),动检2对。",
      },
    ],
  },
  {
    "name": "武孝城际",
    "desc": "武孝线总开行列车80对（不包含热备单机1对，共线列车1对），比上次调图减少2.5对（含共线0.5对临空车底）。其中：办客列车78对（比调图前减少2对），动检车2对。",
    "stations": [
      {
        "name": "孝感东",
        "desc": "共办理列车80对（不包含热备单机1对，共线1对），其中：办理客运业务28对（下行27列、上行29列），通过50对，动检2对。",
      },
      {
        "name": "天河机场",
        "desc": "共办理列车80对（不包含热备单机1对，共线1对），其中：办理客运业务17.5对（下行17列、上行18列），通过60.5对，动检2对。",
      },
      {
        "name": "毛陈",
        "desc": "共办理列车80对（不包含热备单机1对，共线1对），其中：办理客运业务1.5对（下行1列、上行2列），通过76.5对，动检2对。",
      },
    ],
  },
  {
    "name": "武仙城际",
    "desc": "...",
    "stations": [
      {
        "name": "仙桃",
        "desc": "共办理列车17对，列车17对（日常线9对，周末线2对，高峰线4对，动检2对），比上次调图增加7对。",
      }
    ],
  },
]

var station_overview = [
  {
    "name": "汉口本站",
    "desc": "南北双站房结构，目前只使用南站房，待北站房开通使用后，站房面积将达到16.5万平方米；已开通18个站台和20条股道，其中18条到发线、2条正线；无站台柱雨棚8.9万平方米；设置候车室4个，其中基本候车室1个、高架候车室1个、老幼病残孕候车区1个、VIP贵宾俱乐部1个，均配备中央冷暖空调，最高可容纳8000人同时候车；日均发送旅客能力10万人以上，历史最高峰日发送旅客22.03万人（2021年5月1日），是武汉铁路枢纽一等甲级客运站。主要办理旅客、行包等业务。"
  },
  {
    "name": "汉川站",
    "desc": "距离汉口站铁路里程46㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为16.6m，面宽88.2m，进深21.4m，总建筑面积2932㎡，售票厅77㎡（4个售票窗口，1个公安制证窗口，1台自动售票机），候车室734㎡（45*0.8 m *34*0.6 m），贵宾室62㎡，商业区域260㎡，钢结构无柱雨棚面积22263㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m进出站共用地道1座，综控室、行车值守室等生产办公用房13间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name": "天门南站",
    "desc": "距离汉口站铁路里程83㎞，站房为“线侧平式”，主体为1层，两侧局部为2层，建筑主体高度为17.9m，面宽110.8m，进深29.4m，总建筑面积3986㎡，售票厅138㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1094㎡（53*0.8 m *43*0.6 m），贵宾室97㎡，商业区域355㎡，钢结构无柱雨棚面积21041㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name": "仙桃西站",
    "desc": "距离汉口站铁路里程115㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为18.3m，面宽105.6m，进深26m，总建筑面积3992㎡，售票厅152㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1068㎡（53*0.8 m *42*0.6 m），贵宾室60㎡，商业区域340㎡，双肢柱斜拉外挑式钢结构雨棚面积12868㎡，股道4条（正线2条，客货列车到发线2条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name": "潜江站",
    "desc": "距离汉口站铁路里程134㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为17.8m，面宽105.6m，进深27.2m，总建筑面积3996㎡，售票厅152㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1115㎡（54*0.8 m *43*0.6 m），贵宾室64㎡，商业区域345㎡，钢结构无柱雨棚面积22263㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name": "荆州站",
    "desc": "距离汉口站铁路里程204㎞，站房为“线侧下式”，主体为2层，两侧局部为4层，建筑主体高度为24.75m，面宽189m，进深39m，总建筑面积11980㎡，售票厅485㎡（7个售票窗口，1个公安制证窗口，2台自动售票机），候车室4339㎡（131*0.9 m *46*0.8 m），贵宾室206㎡，商业区域1745㎡，钢结构无柱雨棚面积35536㎡，股道8条（正线2条，客货列车到发线6条），设有长度均为550m的基本站台（宽16m）1座和中间站台（宽12m）2座，以及宽度为8m的进站地道1座和宽度为12m的出站兼行包地道1座，综控室、行车值守室等生产办公用房26间，候车厅、售票厅等旅客公共服务区域9个。"
  },
  {
    "name": "枝江北站",
    "desc": "距离汉口站铁路里程249㎞，站房为“线侧平式”，主体为1层，两侧局部为2层，建筑主体高度为16.8m，面宽110.8m，进深29.4m，总建筑面积3986㎡，售票厅138㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1089㎡（54*0.8 m *42*0.6 m），贵宾室95㎡，商业区域355㎡，，钢结构无柱雨棚面积21041㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房14间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name": "仙桃站",
    "desc": "仙桃站位于湖北省仙桃市城区东南方向，中心里程位于仙桃城际16km+837m为尽头式高架车站，采用横列式布局，共4条股道（正线2条，到发线2条），2座岛式高站台（长359.6m、宽12m）。车站主体高度28.401m、宽141.7m、进深64.1m。总建筑面积11998㎡，其中售票厅233.45㎡，进站广厅1404.3㎡，候车厅3453.1㎡，VIP室196.45㎡，商业区域2010.31㎡。钢结构无柱雨棚面积10800㎡。候车大厅座位1500个（500条）。一楼男女厕所各2座，共54个厕位（男蹲位9个、男小便斗9个、女蹲位36个），无障碍厕位1个，二层商业区男女厕所各1座，共10个厕位（男蹲位2个、男小便斗2个、女蹲位6个）。"
  },
  {
    "name": "天河机场站",
    "desc": "..."
  },
  {
    "name": "孝感东站",
    "desc": "..."
  },
  {
    "name": "毛陈站",
    "desc": "..."
  },
]

var device_overview_kf = [
  {
    "index": 1,
    "name": "旅服系统",
    "detail": [
      {
        "规格型号": "旅服集成平台(1-1)",
        "单位": "站",
        "数量": 1,
        "维保费用": "250,000.00 ",
        "备注": "汉口站"
      },
      {
        "规格型号": "旅服集成平台(1-1)",
        "单位": "站",
        "数量": 6,
        "维保费用": "450,000.00 ",
        "备注": "汉宜线"
      },
      {
        "规格型号": "旅服集成平台(1-1)",
        "单位": "站",
        "数量": 8,
        "维保费用": "440,000.00 ",
        "备注": "武孝城际"
      },
      {
        "规格型号": "电子引导系统(1-2)",
        "单位": "㎡",
        "数量": 2115.968,
        "维保费用": "1,057,984.00 ",
        "备注": ""
      },
      {
        "规格型号": "视频监控系统（1-3）",
        "单位": "点",
        "数量": 1192,
        "维保费用": "357,600.00 ",
        "备注": ""
      },
      {
        "规格型号": "广播子系统（1-4）",
        "单位": "套",
        "数量": 15,
        "维保费用": "562,500.00 ",
        "备注": ""
      },
      {
        "规格型号": "时钟子系统（1-5）",
        "单位": "套",
        "数量": 1,
        "维保费用": "150,000.00 ",
        "备注": "汉口站"
      },
      {
        "规格型号": "时钟子系统（1-5）",
        "单位": "套",
        "数量": 6,
        "维保费用": "90,000.00 ",
        "备注": "汉宜线"
      },
      {
        "规格型号": "PDP引导屏（1-6）",
        "单位": "台",
        "数量": 85,
        "维保费用": "127,500.00 ",
        "备注": ""
      },
    ]
  },
  {
    "index": 2,
    "name": "自动售检票设备",
    "detail": [
      {
        "规格型号": "自动售检票核心设备（2-1）",
        "单位": "套",
        "数量": 16,
        "维保费用": "424,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "自动售票机（2-2）",
        "单位": "台",
        "数量": 103,
        "维保费用": "1,854,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "自动取票机（2-3）",
        "单位": "台",
        "数量": 41,
        "维保费用": "738,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "自动检票机（2-4）",
        "单位": "台",
        "数量": 122,
        "维保费用": "366,000.00 ",
        "备注": "不含汉口站126台"
      },
      {
        "规格型号": "磁质制票机（2-5）",
        "单位": "台",
        "数量": 157,
        "维保费用": "392,500.00 ",
        "备注": ""
      },
      {
        "规格型号": "人工窗口外显系统（2-6）",
        "单位": "套",
        "数量": 70,
        "维保费用": "35,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "实名制核验闸机（2-7）",
        "单位": "台",
        "数量": 90,
        "维保费用": "270,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "半自助（2-8）",
        "单位": "台",
        "数量": 46,
        "维保费用": 0,
        "备注": "质保期"
      },
    ]
  },
  {
    "index": 3,
    "name": "安检系统",
    "detail": [
      {
        "规格型号": "三品检查仪（4-1）",
        "单位": "台",
        "数量": 47,
        "维保费用": "846,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "安检门（4-2）",
        "单位": "台",
        "数量": 41,
        "维保费用": "123,000.00 ",
        "备注": ""
      },
    ]
  },
  {
    "index": 4,
    "name": "静态标识",
    "detail": [
      {
        "规格型号": "站名发光字（5-1）",
        "单位": "㎡",
        "数量": 650.2,
        "维保费用": "130,040.00 ",
        "备注": ""
      },
      {
        "规格型号": "静态引导标识（5-2)",
        "单位": "㎡",
        "数量": 1502.48,
        "维保费用": "450,744.00 ",
        "备注": ""
      },

    ]
  },
  {
    "index": 5,
    "name": "电梯类",
    "detail": [
      {
        "规格型号": "自动扶梯（6-2）",
        "单位": "部",
        "数量": 127,
        "维保费用": "3,175,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "垂直升降机（6-3）",
        "单位": "部",
        "数量": 37,
        "维保费用": "925,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "行包货梯（6-4）",
        "单位": "部",
        "数量": 0,
        "维保费用": 0,
        "备注": ""
      },

    ]
  },
  {
    "index": 6,
    "name": "空调系统",
    "detail": [
      {
        "规格型号": "空调系统（7－1）",
        "单位": "站",
        "数量": 1,
        "维保费用": "830,000.00 ",
        "备注": "汉口站"
      },
      {
        "规格型号": "空调系统（7－1）",
        "单位": "站",
        "数量": 6,
        "维保费用": "930,000.00 ",
        "备注": "汉宜线"
      },
      {
        "规格型号": "空调系统（7－1）",
        "单位": "站",
        "数量": 9,
        "维保费用": "495,000.00 ",
        "备注": "武孝城际"
      },

    ]
  },
  {
    "index": 7,
    "name": "保洁设备",
    "detail": [
      {
        "规格型号": "保洁设备(8-1)",
        "单位": "项",
        "数量": 1,
        "维保费用": "70,000.00 ",
        "备注": ""
      },

    ]
  },
  {
    "index": 8,
    "name": "基础类设施",
    "detail": [
      {
        "规格型号": "列车上水设备（9-1)",
        "单位": "条",
        "数量": 12,
        "维保费用": "420,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "固定吸污设备（9-2）",
        "单位": "条",
        "数量": 3,
        "维保费用": "495,000.00 ",
        "备注": ""
      },
      {
        "规格型号": "站台安全屏蔽门（9-3）",
        "单位": "条",
        "数量": 12,
        "维保费用": "660,000.00 ",
        "备注": "槐荫站等6站"
      },
      {
        "规格型号": "站台安全屏蔽门（9-3）",
        "单位": "条",
        "数量": 4,
        "维保费用": "380,000.00 ",
        "备注": "天河机场站"
      }

    ]
  },
  {
    "index": 9,
    "name": "门禁子系统",
    "detail": [
      {
        "规格型号": "门禁子系统（3-1）",
        "单位": "套",
        "数量": 0,
        "维保费用": 0,
        "备注": ""
      },

    ]
  },
]

var device_overview_yd = [
  {
    "name": "售检手持机",
    "detail": [
      { "address": "客运车间", "count": 0 },
      { "address": "售票车间", "count": 0 },
      { "address": "汉川站", "count": 0 },
      { "address": "天门南站", "count": 0 },
      { "address": "仙桃西站", "count": 0 },
      { "address": "潜江站", "count": 0 },
      { "address": "荆州站", "count": 0 },
      { "address": "枝江北站", "count": 0 },
      { "address": "孝感东站", "count": 0 },
      { "address": "天河机场站", "count": 0 },
    ]
  },
  {
    "name": "执法记录仪",
    "detail": [
      { "address": "客运车间", "count": 0 },
      { "address": "售票车间", "count": 0 },
      { "address": "汉川站", "count": 0 },
      { "address": "天门南站", "count": 0 },
      { "address": "仙桃西站", "count": 0 },
      { "address": "潜江站", "count": 0 },
      { "address": "荆州站", "count": 0 },
      { "address": "枝江北站", "count": 0 },
      { "address": "孝感东站", "count": 0 },
      { "address": "天河机场站", "count": 0 },
    ]
  },
  {
    "name": "有源移动音箱",
    "detail": [
      { "address": "客运车间", "count": 0 },
      { "address": "售票车间", "count": 0 },
      { "address": "汉川站", "count": 0 },
      { "address": "天门南站", "count": 0 },
      { "address": "仙桃西站", "count": 0 },
      { "address": "潜江站", "count": 0 },
      { "address": "荆州站", "count": 0 },
      { "address": "枝江北站", "count": 0 },
      { "address": "孝感东站", "count": 0 },
      { "address": "天河机场站", "count": 0 },
    ]
  },
  {
    "name": "硬隔离",
    "detail": [
      { "address": "客运车间", "count": 0 },
      { "address": "售票车间", "count": 0 },
      { "address": "汉川站", "count": 0 },
      { "address": "天门南站", "count": 0 },
      { "address": "仙桃西站", "count": 0 },
      { "address": "潜江站", "count": 0 },
      { "address": "荆州站", "count": 0 },
      { "address": "枝江北站", "count": 0 },
      { "address": "孝感东站", "count": 0 },
      { "address": "天河机场站", "count": 0 },
    ]
  },
]

var device_overview = [

]

module.exports = {
  lines,
  station_overview,
  device_overview_kf,
  device_overview_yd
}
