var lines = [
    {
      "name": "汉口本站",
      "stations": [
        "汉口"
      ]
    },
    {
      "name": "汉宜客专",
      "stations": [
        "汉川", "天门南", "仙桃西", "潜江", "荆州", "枝江北"
      ]
    },
    {
      "name": "武孝城际",
      "stations": [
        "天河机场", "孝感东", "毛陈","闵集","天河街","后湖","金银潭"
      ]
    },
    {
      "name": "武仙城际",
      "stations": [
        "仙桃"
      ]
    },
  ]

var station_overview = [
  {
    "name" : "汉口本站",
    "desc" : "南北双站房结构，目前只使用南站房，待北站房开通使用后，站房面积将达到16.5万平方米；已开通18个站台和20条股道，其中18条到发线、2条正线；无站台柱雨棚8.9万平方米；设置候车室4个，其中基本候车室1个、高架候车室1个、老幼病残孕候车区1个、VIP贵宾俱乐部1个，均配备中央冷暖空调，最高可容纳8000人同时候车；日均发送旅客能力10万人以上，历史最高峰日发送旅客22.03万人（2021年5月1日），是武汉铁路枢纽一等甲级客运站。主要办理旅客、行包等业务。"
  },
  {
    "name" : "汉川站",
    "desc" : "距离汉口站铁路里程46㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为16.6m，面宽88.2m，进深21.4m，总建筑面积2932㎡，售票厅77㎡（4个售票窗口，1个公安制证窗口，1台自动售票机），候车室734㎡（45*0.8 m *34*0.6 m），贵宾室62㎡，商业区域260㎡，钢结构无柱雨棚面积22263㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m进出站共用地道1座，综控室、行车值守室等生产办公用房13间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name" : "天门南站",
    "desc" : "距离汉口站铁路里程83㎞，站房为“线侧平式”，主体为1层，两侧局部为2层，建筑主体高度为17.9m，面宽110.8m，进深29.4m，总建筑面积3986㎡，售票厅138㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1094㎡（53*0.8 m *43*0.6 m），贵宾室97㎡，商业区域355㎡，钢结构无柱雨棚面积21041㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name" : "仙桃西站",
    "desc" : "距离汉口站铁路里程115㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为18.3m，面宽105.6m，进深26m，总建筑面积3992㎡，售票厅152㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1068㎡（53*0.8 m *42*0.6 m），贵宾室60㎡，商业区域340㎡，双肢柱斜拉外挑式钢结构雨棚面积12868㎡，股道4条（正线2条，客货列车到发线2条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name" : "潜江站",
    "desc" : "距离汉口站铁路里程134㎞，站房为“线侧下式”，主体为1层，两侧局部为2层，建筑主体高度为17.8m，面宽105.6m，进深27.2m，总建筑面积3996㎡，售票厅152㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1115㎡（54*0.8 m *43*0.6 m），贵宾室64㎡，商业区域345㎡，钢结构无柱雨棚面积22263㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房18间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name" : "荆州站",
    "desc" : "距离汉口站铁路里程204㎞，站房为“线侧下式”，主体为2层，两侧局部为4层，建筑主体高度为24.75m，面宽189m，进深39m，总建筑面积11980㎡，售票厅485㎡（7个售票窗口，1个公安制证窗口，2台自动售票机），候车室4339㎡（131*0.9 m *46*0.8 m），贵宾室206㎡，商业区域1745㎡，钢结构无柱雨棚面积35536㎡，股道8条（正线2条，客货列车到发线6条），设有长度均为550m的基本站台（宽16m）1座和中间站台（宽12m）2座，以及宽度为8m的进站地道1座和宽度为12m的出站兼行包地道1座，综控室、行车值守室等生产办公用房26间，候车厅、售票厅等旅客公共服务区域9个。"
  },
  {
    "name" : "枝江北站",
    "desc" : "距离汉口站铁路里程249㎞，站房为“线侧平式”，主体为1层，两侧局部为2层，建筑主体高度为16.8m，面宽110.8m，进深29.4m，总建筑面积3986㎡，售票厅138㎡（7个售票窗口，1个公安制证窗口，1台自动售票机），候车室1089㎡（54*0.8 m *42*0.6 m），贵宾室95㎡，商业区域355㎡，，钢结构无柱雨棚面积21041㎡，股道6条（正线2条，客货列车到发线3条，货物列车到发线1条），设有长度均为550m的基本站台（宽10m）和中间站台（宽10.5m）各1座，以及宽度为8m的进出站共用地道1座，综控室、行车值守室等生产办公用房14间，候车厅、售票厅等旅客公共服务区域6个。"
  },
  {
    "name" : "仙桃站",
    "desc" : "仙桃站位于湖北省仙桃市城区东南方向，中心里程位于仙桃城际16km+837m为尽头式高架车站，采用横列式布局，共4条股道（正线2条，到发线2条），2座岛式高站台（长359.6m、宽12m）。车站主体高度28.401m、宽141.7m、进深64.1m。总建筑面积11998㎡，其中售票厅233.45㎡，进站广厅1404.3㎡，候车厅3453.1㎡，VIP室196.45㎡，商业区域2010.31㎡。钢结构无柱雨棚面积10800㎡。候车大厅座位1500个（500条）。一楼男女厕所各2座，共54个厕位（男蹲位9个、男小便斗9个、女蹲位36个），无障碍厕位1个，二层商业区男女厕所各1座，共10个厕位（男蹲位2个、男小便斗2个、女蹲位6个）。"
  },
  {
    "name" : "天河机场站",
    "desc" : "..."
  },
  {
    "name" : "孝感东站",
    "desc" : "..."
  },
  {
    "name" : "毛陈站",
    "desc" : "..."
  },
]

var device_overview_kf = [
  {
    "name" : "电梯",
    "detail" : [
      {"address" : "汉口本站-出站", "count": 0},
      {"address" : "汉口本站-广厅", "count": 6},
      {"address" : "汉口本站-站台", "count": 0},
      {"address" : "荆州站-站台", "count": 0},
    ]
  },
  {
    "name" : "空调",
    "detail" : [
      {"address" : "候车室", "count" : 1},
      {"address" : "贵宾室", "count" : 1},
      {"address" : "旅服VIP", "count" : 1},
    ]
  },
  {
    "name" : "闸机",
    "detail" : [
      {"address" : "汉口本站-地面进站口", "count" : 1},
      {"address" : "汉口本站-地面出站口", "count" : 1},
      {"address" : "汉口本站-基本候车室", "count" : 1},
      {"address" : "汉口本站-高架候车室", "count" : 1},
    ]
  },
]

var device_overview_yd = [
  {
    "name" : "售检手持机",
    "detail" : [
      {"address" : "客运车间", "count" : 0},
      {"address" : "售票车间", "count" : 0},
      {"address" : "汉川站", "count" : 0},
      {"address" : "天门南站", "count" : 0},
      {"address" : "仙桃西站", "count" : 0},
      {"address" : "潜江站", "count" : 0},
      {"address" : "荆州站", "count" : 0},
      {"address" : "枝江北站", "count" : 0},
      {"address" : "孝感东站", "count" : 0},
      {"address" : "天河机场站", "count" : 0},
    ]
  },
  {
    "name" : "执法记录仪",
    "detail" : [
      {"address" : "客运车间", "count" : 0},
      {"address" : "售票车间", "count" : 0},
      {"address" : "汉川站", "count" : 0},
      {"address" : "天门南站", "count" : 0},
      {"address" : "仙桃西站", "count" : 0},
      {"address" : "潜江站", "count" : 0},
      {"address" : "荆州站", "count" : 0},
      {"address" : "枝江北站", "count" : 0},
      {"address" : "孝感东站", "count" : 0},
      {"address" : "天河机场站", "count" : 0},
    ]
  },
  {
    "name" : "有源移动音箱",
    "detail" : [
      {"address" : "客运车间", "count" : 0},
      {"address" : "售票车间", "count" : 0},
      {"address" : "汉川站", "count" : 0},
      {"address" : "天门南站", "count" : 0},
      {"address" : "仙桃西站", "count" : 0},
      {"address" : "潜江站", "count" : 0},
      {"address" : "荆州站", "count" : 0},
      {"address" : "枝江北站", "count" : 0},
      {"address" : "孝感东站", "count" : 0},
      {"address" : "天河机场站", "count" : 0},
    ]
  },
  {
    "name" : "硬隔离",
    "detail" : [
      {"address" : "客运车间", "count" : 0},
      {"address" : "售票车间", "count" : 0},
      {"address" : "汉川站", "count" : 0},
      {"address" : "天门南站", "count" : 0},
      {"address" : "仙桃西站", "count" : 0},
      {"address" : "潜江站", "count" : 0},
      {"address" : "荆州站", "count" : 0},
      {"address" : "枝江北站", "count" : 0},
      {"address" : "孝感东站", "count" : 0},
      {"address" : "天河机场站", "count" : 0},
    ]
  },
]

module.exports = {
  lines,
  station_overview,
  device_overview_kf,
  device_overview_yd
}
